
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВремяНачалаРаботы  			= ?(ХранилищеОбщихНастроек.Загрузить("ВремяРаботы", "ВремяНачалаРаботы")		= Неопределено, '000101011000', ХранилищеОбщихНастроек.Загрузить("ВремяРаботы", "ВремяНачалаРаботы"));
	ВремяОкончанияРаботы 		= ?(ХранилищеОбщихНастроек.Загрузить("ВремяРаботы", "ВремяОкончанияРаботы")		= Неопределено, '000101011900', ХранилищеОбщихНастроек.Загрузить("ВремяРаботы", "ВремяОкончанияРаботы")); 
	КратностьВремениЗаписи		= ?(ХранилищеОбщихНастроек.Загрузить("ВремяРаботы", "КратностьВремениЗаписи")	= Неопределено, 30, 			ХранилищеОбщихНастроек.Загрузить("ВремяРаботы", "КратностьВремениЗаписи"));; 

	ЦветЗаписиКлиента 			= ?(ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветЗаписиКлиента") 		= Неопределено, Новый Цвет(255, 232, 179), 	ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветЗаписиКлиента")); 
	ЦветПервичнойЗаписи 		= ?(ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветПервичнойЗаписи") 		= Неопределено, Новый Цвет(255, 165, 179), 	ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветПервичнойЗаписи"));;
	ЦветПодтвержденнойЗаписи 	= ?(ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветПодтвержденнойЗаписи")	= Неопределено, Новый Цвет(0, 255, 0), 		ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветПодтвержденнойЗаписи"));;
	ЦветНеявки 					= ?(ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветНеявки") 				= Неопределено, Новый Цвет(255, 140, 105), 	ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветНеявки"));;
	ЦветПрочейЗаписи 			= ?(ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветПрочейЗаписи") 		= Неопределено, Новый Цвет(255, 165, 0), 	ХранилищеОбщихНастроек.Загрузить("ЖурналЗаписиНаПрием", "ЦветПрочейЗаписи"));;
	
	Счетчик = 0;
	Пока '000101010100' + Счетчик * 3600 < '000101012359' Цикл
	    Время = '000101010100' + Счетчик * 3600;
		Элементы.ВремяНачалаРаботы.СписокВыбора.Добавить(Время, Формат(Время, "ДФ=ЧЧ:мм"));
		Элементы.ВремяОкончанияРаботы.СписокВыбора.Добавить(Время, Формат(Время, "ДФ=ЧЧ:мм"));
	    Счетчик = Счетчик + 1;
	КонецЦикла; 
				
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
		
	СохранитьНастройки();
		
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
		
	ХранилищеОбщихНастроек.Сохранить("ВремяРаботы", "ВремяНачалаРаботы", 		ВремяНачалаРаботы);
	ХранилищеОбщихНастроек.Сохранить("ВремяРаботы", "ВремяОкончанияРаботы", 	ВремяОкончанияРаботы);
	ХранилищеОбщихНастроек.Сохранить("ВремяРаботы", "КратностьВремениЗаписи", 	КратностьВремениЗаписи);
	
	ХранилищеОбщихНастроек.Сохранить("ЖурналЗаписиНаПрием", "ЦветЗаписиКлиента", 		ЦветЗаписиКлиента);
	ХранилищеОбщихНастроек.Сохранить("ЖурналЗаписиНаПрием", "ЦветПервичнойЗаписи", 		ЦветПервичнойЗаписи);
	ХранилищеОбщихНастроек.Сохранить("ЖурналЗаписиНаПрием", "ЦветПодтвержденнойЗаписи",	ЦветПодтвержденнойЗаписи);
	ХранилищеОбщихНастроек.Сохранить("ЖурналЗаписиНаПрием", "ЦветНеявки", 				ЦветНеявки);
	ХранилищеОбщихНастроек.Сохранить("ЖурналЗаписиНаПрием", "ЦветПрочейЗаписи", 		ЦветПрочейЗаписи);
		
КонецПроцедуры

#КонецОбласти
