Функция ПолучитьДанныеЗаПериод(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос();
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	уп_ГрафикРаботы.Сотрудник,
	               |	уп_ГрафикРаботы.Клиент,
	               |	уп_ГрафикРаботы.Помещение,
	               |	уп_ГрафикРаботы.ВремяНачала,
	               |	уп_ГрафикРаботы.Процедура,
	               |	уп_ГрафикРаботы.ВремяОкончания,
	               |	уп_ГрафикРаботы.Состояние
	               |ИЗ
	               |	РегистрСведений.уп_ГрафикРаботы КАК уп_ГрафикРаботы
	               |ГДЕ
	               |	уп_ГрафикРаботы.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьСвободныхСотрудниковНаПериод (НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГрафикиРаботыСотрудников.Сотрудник
	               |ИЗ
	               |	РегистрСведений.ГрафикиРаботыСотрудников КАК ГрафикиРаботыСотрудников,
	               |	(ВЫБРАТЬ
	               |		уп_ГрафикРаботы.Сотрудник КАК Сотрудник
	               |	ИЗ
	               |		РегистрСведений.уп_ГрафикРаботы КАК уп_ГрафикРаботы
	               |	ГДЕ
	               |		уп_ГрафикРаботы.Период = НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
	               |		И (уп_ГрафикРаботы.ВремяНачала >= &КонецПериода
	               |				ИЛИ уп_ГрафикРаботы.ВремяОкончания <= &НачалоПериода)) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ГрафикиРаботыСотрудников.ВремяНачала <= &НачалоПериода
	               |	И ГрафикиРаботыСотрудников.ВремяОкончания >= &КонецПериода
	               |	И НАЧАЛОПЕРИОДА(ГрафикиРаботыСотрудников.ВремяНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
КонецФункции

Функция ЗакрытьЗаписьГрафика(Сотрудник, Клиент, Помещение, ВремяНачала) Экспорт
	НаборЗаписейГрафика = РегистрыСведений.уп_ГрафикРаботы.СоздатьНаборЗаписей();
	НаборЗаписейГрафика.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписейГрафика.Отбор.Клиент.Установить(Клиент);
	НаборЗаписейГрафика.Отбор.Помещение.Установить(Помещение);
	НаборЗаписейГрафика.Отбор.ВремяНачала.Установить(ВремяНачала);
	НаборЗаписейГрафика.Прочитать();
	Если НаборЗаписейГрафика.Количество() > 0 Тогда
		Для Каждого ЗаписьГрафика Из НаборЗаписейГрафика Цикл
			Если ЗаписьГрафика.Состояние <> Перечисления.уп_СостоянияГрафика.Закрыт Тогда
				ЗаписьГрафика.Состояние = Перечисления.уп_СостоянияГрафика.Закрыт;
				НаборЗаписейГрафика.Записать(Истина);
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ОткрытьЗаписьГрафика(Сотрудник, Клиент, Помещение, ВремяНачала) Экспорт
	НаборЗаписейГрафика = РегистрыСведений.уп_ГрафикРаботы.СоздатьНаборЗаписей();
	НаборЗаписейГрафика.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписейГрафика.Отбор.Клиент.Установить(Клиент);
	НаборЗаписейГрафика.Отбор.Помещение.Установить(Помещение);
	НаборЗаписейГрафика.Отбор.ВремяНачала.Установить(ВремяНачала);
	НаборЗаписейГрафика.Прочитать();
	Если НаборЗаписейГрафика.Количество() > 0 Тогда
		Для Каждого ЗаписьГрафика Из НаборЗаписейГрафика Цикл
			Если ЗаписьГрафика.Состояние = Перечисления.уп_СостоянияГрафика.Закрыт Тогда
				ЗаписьГрафика.Состояние = Перечисления.уп_СостоянияГрафика.Автоматический;
				НаборЗаписейГрафика.Записать(Истина);
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции