
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КодПомещения = Параметры.КодПомещения;
	Помещение = Справочники.Помещения.НайтиПоКоду(КодПомещения, Истина);
	Список = Параметры.Список;
	ВремяНачала = Параметры.ВремяНачала;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Помещение", Помещение);
	ПараметрыОтбора.Вставить("ВремяНачала", ВремяНачала);
	МассивПроцедур = Объект.Процедуры.НайтиСтроки(ПараметрыОтбора);
	Для Каждого Проц Из Список Цикл
		НС = СписокПар.Добавить();
		НС.Сотрудник = Проц.Сотрудник;
		НС.Клиент = Проц.Клиент;
		НС.Процедура = Проц.Процедура;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция Расписание()
	МассивОтвета = Новый Массив;
	Для Каждого Строка Из СписокПар Цикл
		Если ЗначениеЗаполнено(Строка.Сотрудник) И ЗначениеЗаполнено(Строка.Клиент) И ЗначениеЗаполнено(Строка.Процедура) Тогда
			МассивОтвета.Добавить(Новый Структура("Сотрудник, Клиент, Процедура, Помещение, ВремяНачала", Строка.Сотрудник, Строка.Клиент, Строка.Процедура, Помещение, ВремяНачала));	
		КонецЕсли;
	КонецЦикла;
	Возврат МассивОтвета;
КонецФункции

&НаКлиенте
Процедура Ок(Команда)
	РасписаниеДня = Расписание();
	ОповеститьОВыборе(Новый Структура("Расписание", РасписаниеДня));
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ОповеститьОВыборе(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПолучитьКлиентовСОстаткамиПроцедурССервера()
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Время", ВремяНачала);
	ПараметрыОтбора.Вставить("Помещение", Помещение);
	ТЗ = уп_РаботаСГрафикомСервер.ПолучитьКлиентовСОстаткамиПроцедурТЗ(ПараметрыОтбора);
	СписокПар.Очистить();
	Для Каждого Клиент Из ТЗ Цикл
		НС = СписокПар.Добавить();
		НС.Клиент = Клиент.Клиент;
		НС.Процедура = Клиент.Процедура;
		НС.Сотрудник = Клиент.Сотрудник;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлиентов(Команда)
	ПолучитьКлиентовСОстаткамиПроцедурССервера();
КонецПроцедуры
