
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиПроцедур.Записывать = Истина;
	Движение = Движения.ОстаткиПроцедур.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Процедура = ПроведеннаяПроцедура;
	Движение.Количество = 1;
	
	РегистрыСведений.уп_ГрафикРаботы.ЗакрытьЗаписьГрафика(Сотрудник, Клиент, Помещение, Дата);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	РегистрыСведений.уп_ГрафикРаботы.ОткрытьЗаписьГрафика(Сотрудник, Клиент, Помещение, Дата);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = уп_СотрудникиПовторноеИспользование.ПолучитьСотрудникаПоПользователю(ПараметрыСеанса.АвторизованныйПользователь);
КонецПроцедуры
