#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//ЗащитаПерсональныхДанных.ДобавитьКомандуПечатиСогласияНаОбработкуПерсональныхДанных(КомандыПечати);
	
КонецПроцедуры

#КонецОбласти

Функция РазностьДатВМесяцах(Знач Дата1, Знач Дата2) Экспорт 
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ РАЗНОСТЬДАТ(&Дата1, &Дата2, МЕСЯЦ) КАК Результат";
    Запрос.УстановитьПараметр("Дата1", Дата1);
    
    Если Месяц(Дата1) = Месяц(Дата2) и День(Дата1) > День(Дата2) Тогда
        Дата2 = ДобавитьМесяц(Дата2,-1);
    КонецЕсли; 
    
    Запрос.УстановитьПараметр("Дата2", Дата2);
    Выборка = Запрос.Выполнить().Выбрать();
    Выборка.Следующий();
    
    Возврат Выборка.Результат;
    
КонецФункции

#КонецЕсли