Функция ПолучитьСотрудникаПоФизЛицу (ФизЛицо) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудники.Активен";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Возврат Результат.Ссылка;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

Функция ПолучитьСотрудникаПоПользователю (Пользователь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Сотрудники.Ссылка
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ
	               |	Сотрудники.ФизическоеЛицо = &ФизическоеЛицо
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудники.Активен";
	Запрос.УстановитьПараметр("ФизическоеЛицо", Пользователь.ФизическоеЛицо);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Возврат Результат.Ссылка;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции