
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	Если Справочники.Организации.КоличествоОрганизаций() = 1 Тогда
		Элементы.Организация.Видимость = Ложь;   
	КонецЕсли;	
	
	ГрафикРаботы = ТекущаяДата();
	
	ЗаполнитьДаннымиТекущегоГода();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.ГрафикРаботы.НачалоПериодаОтображения = НачалоМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ГрафикРаботыПриВыводеПериода(Элемент, ОформлениеПериода)
		Для Каждого СтрокаОформленияПериода Из ОформлениеПериода.Даты Цикл
		Если ДниГрафика.Получить(СтрокаОформленияПериода.Дата) = Неопределено Тогда
			ЦветТекстаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ВидДняПроизводственногоКалендаряНеУказанЦвет");
		Иначе
			ЦветТекстаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ВидДняПроизводственногоКалендаряРабочийЦвет");
		КонецЕсли;
		СтрокаОформленияПериода.ЦветТекста = ЦветТекстаДня;
		// Ручное редактирование
		//Если ДниИзмененные.Получить(СтрокаОформленияПериода.Дата) = Неопределено Тогда
			ЦветФонаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветФонаПоля");
		//Иначе
		//	ЦветФонаДня = ОбщегоНазначенияКлиент.ЦветСтиля("ДатаГрафикаИзмененнаяФон");
		//КонецЕсли;
		СтрокаОформленияПериода.ЦветФона = ЦветФонаДня;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиТекущегоГода(ЗначениеКопирования = Неопределено)
	
	// Заполняет форму данными текущего года.
	
//	НастроитьПолеКалендаря();
	
//	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
//		ГрафикСсылка = ЗначениеКопирования;
//	Иначе
//		ГрафикСсылка = Объект.Ссылка;
//	КонецЕсли;
	
	ДниГрафика = Новый ФиксированноеСоответствие(
		Справочники.Сотрудники.ПрочитатьДанныеГрафикаИзРегистра(Объект.Сотрудник, НачалоГода(ТекущаяДата()), КонецГода(ТекущаяДата())));

	//ПрочитатьПризнакРучногоРедактирования(Объект, НомерТекущегоГода);
	//
	//// Если нет ручных корректировок и данных тоже нет, то формируем результат по шаблону за выбранный год.
	//Если ДниГрафика.Количество() = 0 И ДниИзмененные.Количество() = 0 Тогда
	//	ДниВключенныеВГрафик = Справочники.Календари.ДниВключенныеВГрафик(
	//								Объект.ДатаНачала, 
	//								Объект.СпособЗаполнения, 
	//								Объект.ШаблонЗаполнения, 
	//								Дата(НомерТекущегоГода, 12, 31),
	//								Объект.ПроизводственныйКалендарь, 
	//								Объект.УчитыватьПраздники, 
	//								Объект.ДатаОтсчета);
	//	ДниГрафика = Новый ФиксированноеСоответствие(ДниВключенныеВГрафик);
	//КонецЕсли;
	//
	//УстановитьСнятьМодифицированностьРезультата(ЭтотОбъект, Ложь);
	//УстановитьСнятьПризнакСоответствияРезультатовШаблону(ЭтотОбъект, Не МодифицированностьШаблона);

КонецПроцедуры


&НаКлиенте
Процедура ГрафикРаботыПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ЗаполнитьДаннымиТекущегоГода();
	Элементы.ГрафикРаботы.Обновить();

КонецПроцедуры


&НаКлиенте
Процедура ГрафикРаботыВыбор(Элемент, ВыбраннаяДата)
		Если ДниГрафика.Получить(ВыбраннаяДата) = Неопределено Тогда
		// Включаем в график
		ГрафикиРаботыКлиентСервер.ВставитьВФиксированноеСоответствие(ДниГрафика, ВыбраннаяДата, Истина);
		ДеньВключенВГрафик = Истина;
	Иначе
		// Исключаем из графика
		ГрафикиРаботыКлиентСервер.УдалитьИзФиксированногоСоответствия(ДниГрафика, ВыбраннаяДата);
		ДеньВключенВГрафик = Ложь;
	КонецЕсли;
		
	Элементы.ГрафикРаботы.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Справочники.Сотрудники.ЗаписатьДанныеГрафикаВРегистр(Объект.Сотрудник, ДниГрафика, НАчалоГода(ТекущаяДата()), КонецГода(ТекущаяДата()));
КонецПроцедуры
