
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("ФизическоеЛицо") Тогда
			Объект.ФизическоеЛицо = Параметры.ЗначенияЗаполнения.ФизическоеЛицо;
			Объект.Наименование = Объект.ФизическоеЛицо.Наименование;
		КонецЕсли;
		Если Параметры.ЗначенияЗаполнения.Свойство("Наименование") Тогда
			Объект.Наименование = Параметры.ЗначенияЗаполнения.Наименование;
		КонецЕсли;
		Объект.Активен = Истина;
		Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	Элементы.Организация.Видимость = Справочники.Организации.КоличествоОрганизаций() > 1;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Владелец", ЭтаФорма.ВладелецФормы);
	Оповестить("Запись_Сотрудники", ПараметрыОбъекта, Объект.Ссылка); 	
КонецПроцедуры