Функция ПолучитьСписокАктивныхПомещений() Экспорт
	Запрос = Новый Запрос();
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	Помещения.Ссылка,
	               |	Помещения.Наименование,
	               |	Помещения.НеЗаниматьПоВозможности КАК НеЗаниматьПоВозможности,
	               |	Помещения.Код
	               |ИЗ
	               |	Справочник.Помещения КАК Помещения
	               |ГДЕ
	               |	Помещения.Активно = ИСТИНА
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НеЗаниматьПоВозможности";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьМассивПроцедурПоПомещению(Помещение) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПомещенияСписокВозможныхПроцедур.Процедура
	               |ИЗ
	               |	Справочник.Помещения.СписокВозможныхПроцедур КАК ПомещенияСписокВозможныхПроцедур";
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Процедура");
КонецФункции