#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ПроверитьСостояниеНаСервере(Объект.Состояние) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для записи изменений необходимо выбрать другое состояние!", , "Состояние",,Отказ);
	КонецЕсли;
	Объект.Дата = Дата(Формат(Объект.Дата, "ДФ=ггггММдд") + Формат(Объект.ВремяНачала, "ДФ=ЧЧммсс"));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Удалить(Команда)
	Если УдалитьДокументНаСервере() Тогда
		Оповестить("Удаление_ПредварительнаяЗапись", , ЭтаФорма);
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УдалитьДокументНаСервере()
	
	Возврат уп_ПредварительнаяЗапись.УдалитьПредварительнуюЗапись(Объект.Ссылка);   
	
Конецфункции

&НаСервереБезКонтекста
Функция ПроверитьСостояниеНаСервере(Состояние)
	Возврат Состояние <> Перечисления.уп_СостоянияНазначений.Автоматическая;
КонецФункции

#КонецОбласти      
