#Область ОбработчикиСобытийФормы
//Код процедур и функций
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Удалить(Команда)
	Если УдалитьДокументНаСервере() Тогда
		Оповестить("Удаление_ПредварительнаяЗапись", , ЭтаФорма);
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УдалитьДокументНаСервере()
	
	Возврат уп_ПредварительнаяЗапись.УдалитьПредварительнуюЗапись(Объект.Ссылка);   
	
Конецфункции

#КонецОбласти      
