Функция ПолучитьКлиентовСОстаткамиПроцедур() Экспорт
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Клиент
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Клиент КАК Клиент,
	               |		ВложенныйЗапрос.Процедура КАК Процедура,
	               |		СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ОстаткиПроцедурОстатки.Клиент КАК Клиент,
	               |			ОстаткиПроцедурОстатки.Процедура КАК Процедура,
	               |			ОстаткиПроцедурОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |		ИЗ
	               |			РегистрНакопления.ОстаткиПроцедур.Остатки КАК ОстаткиПроцедурОстатки
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			уп_ГрафикРаботы.Клиент,
	               |			уп_ГрафикРаботы.Назначение,
	               |			СУММА(-1)
	               |		ИЗ
	               |			РегистрСведений.уп_ГрафикРаботы КАК уп_ГрафикРаботы
	               |		ГДЕ
	               |			уп_ГрафикРаботы.Состояние <> ЗНАЧЕНИЕ(Перечисление.уп_СостоянияГрафика.Закрыт)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			уп_ГрафикРаботы.Клиент,
	               |			уп_ГрафикРаботы.Назначение) КАК ВложенныйЗапрос
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВложенныйЗапрос.Клиент,
	               |		ВложенныйЗапрос.Процедура) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ВложенныйЗапрос.КоличествоОстаток > 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Клиент";	
	Запрос = Новый Запрос (ТекстЗапроса);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.ВыгрузитьКолонку("Клиент");			
КонецФункции

Функция ПолучитьКлиентовСОстаткамиПроцедурТЗ(Параметры) Экспорт
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КлиентыИПроцедуры.Клиент,
	               |	КлиентыИПроцедуры.Процедура,
	               |	СотрудникиОказываемыеПроцедуры.Ссылка КАК Сотрудник
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Клиент КАК Клиент,
	               |		ВложенныйЗапрос.Процедура КАК Процедура,
	               |		СУММА(ВложенныйЗапрос.КоличествоОстаток) КАК КоличествоОстаток
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ОстаткиПроцедурОстатки.Клиент КАК Клиент,
	               |			ОстаткиПроцедурОстатки.Процедура КАК Процедура,
	               |			ОстаткиПроцедурОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |		ИЗ
	               |			РегистрНакопления.ОстаткиПроцедур.Остатки(&Период, Процедура В (&Процедуры)) КАК ОстаткиПроцедурОстатки
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			уп_ГрафикРаботы.Клиент,
	               |			уп_ГрафикРаботы.Назначение,
	               |			СУММА(-1)
	               |		ИЗ
	               |			РегистрСведений.уп_ГрафикРаботы КАК уп_ГрафикРаботы
	               |		ГДЕ
	               |			уп_ГрафикРаботы.Состояние <> ЗНАЧЕНИЕ(Перечисление.уп_СостоянияГрафика.Закрыт)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			уп_ГрафикРаботы.Клиент,
	               |			уп_ГрафикРаботы.Назначение) КАК ВложенныйЗапрос
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВложенныйЗапрос.Клиент,
	               |		ВложенныйЗапрос.Процедура) КАК КлиентыИПроцедуры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники.ОказываемыеПроцедуры КАК СотрудникиОказываемыеПроцедуры
	               |		ПО КлиентыИПроцедуры.Процедура = СотрудникиОказываемыеПроцедуры.Процедура
	               |ГДЕ
	               |	КлиентыИПроцедуры.КоличествоОстаток > 0
	               |	И СотрудникиОказываемыеПроцедуры.Ссылка В(&СвободныеСотрудники)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КлиентыИПроцедуры.Клиент,
	               |	КлиентыИПроцедуры.Процедура,
	               |	СотрудникиОказываемыеПроцедуры.Ссылка";	
	Запрос = Новый Запрос (ТекстЗапроса);
	Запрос.УстановитьПараметр("Процедуры", Справочники.Помещения.ПолучитьМассивПроцедурПоПомещению(Параметры.Помещение));
	Запрос.УстановитьПараметр("Период", Параметры.Время);
	Запрос.УстановитьПараметр("СвободныеСотрудники", РегистрыСведений.уп_ГрафикРаботы.ПолучитьСвободныхСотрудниковНаПериод(Параметры.Время, Параметры.Время + 45*60)); //TODO: Придумать что-нибудь с периодом
	
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;			
КонецФункции