#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//TODO: Продумать проверку заполнения для пар Кабинет и Процедура, Процедура и Сотрудник и т.д.
	
	//Если ТипЗаписи = Перечисления.ТипыПредварительнойЗаписи.ЗаписьКлиента Тогда
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ВидПрочейЗаписи"));		
	//Иначе		
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Клиент"));
	//КонецЕсли;
	//
	//Если ЗначениеЗаполнено(Сотрудник) Тогда 
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Кабинет"));	
	//ИначеЕсли ЗначениеЗаполнено(Кабинет) Тогда 
	//	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Сотрудник"));	
	//КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//TODO: Написать обработчик проведения документа
	
	// регистр уп_ГрафикРаботы
	Движения.уп_ГрафикРаботы.Записывать = Истина;
	Движение = Движения.уп_ГрафикРаботы.Добавить();
	Движение.Период 			= Дата;
	Движение.Сотрудник 			= Сотрудник;
	Движение.Клиент 			= Клиент;
	Движение.Помещение 			= Помещение;
	Движение.ВремяНачала 		= ВремяНачала;
	Движение.Назначение			= Назначение;
	//Движение.ТипЗаписи 			= ТипЗаписи;	
	//Движение.ВидПрочейЗаписи 	= ВидПрочейЗаписи;
	
	Движение.ВремяОкончания 	= ВремяОкончания;
	
	//Движение.Телефон 			= Телефон;
	//Движение.Подтверждение 		= Подтверждение;	
	//Движение.Неявка 			= Неявка;
	//Движение.Первичная 			= Первичная;
	//Движение.Комментарий 		= Комментарий;

КонецПроцедуры

#КонецОбласти

#КонецЕсли