&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Элементы.СКемЗаключенДоговор.СписокВыбора.Очистить();
	Элементы.СКемЗаключенДоговор.СписокВыбора.ЗагрузитьЗначения(ПолучитьОтветственныхПоКлиенту());
КонецПроцедуры

&НаСервере
Функция ПолучитьОтветственныхПоКлиенту()
	МассивОтветственных = Новый Массив;
	Если НЕ Объект.Клиент.Пустая() Тогда 
		Для Каждого Родственник Из Объект.Клиент.Родственники Цикл
			МассивОтветственных.Добавить(Родственник.ФизЛицо);
		КонецЦикла;
	КонецЕсли;
	Возврат МассивОтветственных;
КонецФункции

&НаКлиенте
Процедура СКемЗаключенДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(ПолучитьОтветственныхПоКлиенту());
КонецПроцедуры
